{
  "articles": {
    "results": [
      {
        "id": "13757297",
        "uri": "838935676",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2018-03-27",
        "time": "00:26:00",
        "dateTime": "2018-03-27T00:26:00Z",
        "sim": 0.6000000238418579,
        "url": "http://www.arabianbusiness.com/banking-finance/392877-bitcoin-transaction-fees-plummet-to-lowest-levels-since-may-2017",
        "title": "Bitcoin transaction fees plummet to lowest levels since May 2017",
        "body": "Crypto news: Investors staying away from exchanges and price news\n\nIt what might be a good sign for beleaguered Bitcoin, which has suffered a series of jolts in 2018, the average price of transactions on the Bitcoin blockchain fell to just over a dollar - or 0.014 of a Bitcoin. The confirmations, moreover, are now taking less than 10 minutes.\n\nIn one sense this has been driven by lower demand, which is a reflection of a weakness in the overall Bitcoin market, but the other side is that the SegWit (Segregated Witness) scaling solution that was introduced last summer is beginning to stabilise prices and reduce confirmation times - both of which had previously been considered barriers to Bitcoin's user case.\n\nSegWit had recently been introduced by the Bitstamp and Coinbase exchanges to save users transaction fees, and this could be a sign that Bitcoin's utility is improving. And that could open the door to more widespread adoption.\n\nAny holders - sorry, hodlers - or cryptocurrencies are perhaps familiar with the sentiment: from daily, if not hourly, checks on the price of Bitcoin, Ethereum or Ripple at the turn of the year, a good many investors are simply no longer looking at the scale of the declines in the last two months.\n\nStatistics from Similarweb say that traffic to the Coinbase exchange was down 49 percent in February - 123.5 million to 63.1 million. Kraken saw an even bigger drop from 31.7 million in January to 13.8 million in February - more than 56 percent. Well, if they're not visiting, at least they're not selling.\n\nYou can, should you wish, now buy the Venezuelan government's oil-backed cryptocurrency, the Petro, in foreign currency.\n\nAlthough the coin can't be bought with the local Bolivar, investment has been opened up to the Yuan, the Ruble, the Turkish Lira and the Euro - although not any Gulf currency, despite Venezuela's hope that the OPEC countries would invest in the project. Last week, US President Donald Trump banned any US citizen from buying the Petro.\n\nThe buying and selling of Bitcoin in Africa continues to grow, helped in part by the expansion of the peer-to-peer Paxful exchange. According to reports in bitcoinist.com, $40,000,000-worth of Bitcoin is traded on monthly basis on the platform, whose second and third biggest markets after the US are Nigeria and Ghana respectively.\n\nInterestingly, rather than buying and holding for long-term growth, as in South Korea, it appears that the African market is about trading margins as one would with gold, as well as also offsetting the effects of hyperinflation in their own currencies - which, perhaps, is the best proof of Bitcoin's underlying promise.",
        "source": {
          "id": "11407",
          "uri": "arabianbusiness.com",
          "title": "Arabian Business"
        },
        "image": "http://www.arabianbusiness.com/sites/default/files/images/2018/01/14/bitcoin.jpg",
        "wgt": 3
      },
      {
        "id": "13757704",
        "uri": "838937708",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2018-03-27",
        "time": "00:12:00",
        "dateTime": "2018-03-27T00:12:00Z",
        "sim": 0,
        "url": "https://www.dailypolitical.com/2018/03/26/cpchain-cpc-24-hour-trading-volume-hits-6-50-million.html",
        "title": "CPChain (CPC) 24-Hour Trading Volume Hits $6.50 Million",
        "body": "CPChain (CURRENCY:CPC) traded down 5.1% against the US dollar during the 24-hour period ending at 20:00 PM Eastern on March 26th. Over the last week, CPChain has traded up 0.4% against the US dollar. CPChain has a total market capitalization of $24.97 million and approximately $6.50 million worth of CPChain was traded on exchanges in the last 24 hours. One CPChain token can currently be purchased for approximately $0.11 or 0.00001348 BTC on major cryptocurrency exchanges including EtherDelta and IDEX.\n\nHere is how other cryptocurrencies have performed over the last 24 hours:\n\nGet CPChain alerts: Dash (DASH) traded 5.1% lower against the dollar and now trades at $390.24 or 0.04777020 BTC. I/O Coin (IOC) traded down 4.4% against the dollar and now trades at $1.20 or 0.00014744 BTC. ATMChain (ATM) traded down 26.3% against the dollar and now trades at $0.0035 or 0.00000043 BTC. BitSend (BSD) traded down 5.4% against the dollar and now trades at $0.58 or 0.00007133 BTC. B3Coin (KB3) traded 4.9% lower against the dollar and now trades at $0.0131 or 0.00000161 BTC. PinkCoin (PINK) traded 6.3% lower against the dollar and now trades at $0.0175 or 0.00000214 BTC. Synergy (SNRG) traded 6.1% lower against the dollar and now trades at $1.32 or 0.00016170 BTC. Monoeci (XMCC) traded up 5% against the dollar and now trades at $1.16 or 0.00014241 BTC. BlueCoin (BLU) traded 3% lower against the dollar and now trades at $0.0045 or 0.00000055 BTC. InflationCoin (IFLT) traded up 35.8% against the dollar and now trades at $0.0001 or 0.00000001 BTC.\n\nCPChain Profile\n\nCPChain is a PoW/PoS token that uses the X11 hashing algorithm. It was first traded on July 20th, 2015. CPChain's total supply is 999,999,999 tokens and its circulating supply is 226,715,852 tokens. CPChain's official Twitter account is @Capricoin_Team. The official website for CPChain is www.cpchain.io.\n\nAccording to CryptoCompare, \"CapriCoin, or CPC, is a crypto currency based on the X11 algorithm and is both proof of stake and proof of work. The coin has a large premine of 200,000,000 of the total supply of 208,000,000 - 25% is distributed - 50 million is reserved for staisybit and 99 million reserved for inhouse staking... and 1 million reserved for the development team. The proof of stake drops from 2% by 50% increments per year to year 24. The coin has a large premine which looks to be unethical. \"\n\nCPChain Token Trading\n\nCPChain can be traded on the following cryptocurrency exchanges: IDEX and EtherDelta. It is not presently possible to buy CPChain directly using US dollars. Investors seeking to trade CPChain must first buy Ethereum or Bitcoin using an exchange that deals in US dollars such as GDAX, Changelly or Gemini. Investors can then use their newly-acquired Ethereum or Bitcoin to buy CPChain using one of the exchanges listed above.\n\nReceive News & Updates for CPChain Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for CPChain and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.",
        "source": {
          "id": "1",
          "uri": "dailypolitical.com",
          "title": "Daily Political"
        },
        "image": "https://www.marketbeat.com/logos/cryptocurrencies/cpchain.png",
        "wgt": 4
      },
      {
        "id": "13757700",
        "uri": "838937698",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2018-03-27",
        "time": "00:12:00",
        "dateTime": "2018-03-27T00:12:00Z",
        "sim": 0,
        "url": "https://www.dailypolitical.com/2018/03/26/peoplecoin-price-reaches-0-0001-on-exchanges-men.html",
        "title": "PeopleCoin Price Reaches $0.0001 on Exchanges (MEN)",
        "body": "PeopleCoin (CURRENCY:MEN) traded flat against the U.S. dollar during the 1-day period ending at 20:00 PM E.T. on March 26th. PeopleCoin has a market capitalization of $0.00 and approximately $0.00 worth of PeopleCoin was traded on exchanges in the last 24 hours. One PeopleCoin coin can currently be purchased for $0.0001 or 0.00000001 BTC on exchanges. During the last week, PeopleCoin has traded 1% higher against the U.S. dollar.\n\nHere's how related cryptocurrencies have performed during the last 24 hours:\n\nGet PeopleCoin alerts: Ripple (XRP) traded down 6.7% against the dollar and now trades at $0.60 or 0.00007333 BTC. Stellar (XLM) traded 4.6% lower against the dollar and now trades at $0.23 or 0.00002798 BTC. NEO (NEO) traded down 9.1% against the dollar and now trades at $59.49 or 0.00728182 BTC. IOTA (MIOTA) traded down 6.5% against the dollar and now trades at $1.23 or 0.00015113 BTC. TRON (TRX) traded down 2.3% against the dollar and now trades at $0.0444 or 0.00000543 BTC. Tether (USDT) traded up 0.1% against the dollar and now trades at $1.00 or 0.00012271 BTC. VeChain (VEN) traded 5.6% lower against the dollar and now trades at $3.19 or 0.00039035 BTC. Binance Coin (BNB) traded 5.4% lower against the dollar and now trades at $12.12 or 0.00148351 BTC. Walton (WTC) traded up 7.9% against the dollar and now trades at $22.77 or 0.00246724 BTC. Populous (PPT) traded 1.8% lower against the dollar and now trades at $15.31 or 0.00187361 BTC.\n\nAbout PeopleCoin\n\nPeopleCoin's total supply is 750,231,505 coins. PeopleCoin's official website is www.peoplecoin.pw. PeopleCoin's official Twitter account is @peoplecoinnews.\n\nBuying and Selling PeopleCoin\n\nPeopleCoin can be traded on these cryptocurrency exchanges: . It is not presently possible to buy PeopleCoin directly using U.S. dollars. Investors seeking to acquire PeopleCoin must first buy Ethereum or Bitcoin using an exchange that deals in U.S. dollars such as Coinbase, GDAX or Changelly. Investors can then use their newly-acquired Ethereum or Bitcoin to buy PeopleCoin using one of the exchanges listed above.\n\nReceive News & Updates for PeopleCoin Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for PeopleCoin and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.",
        "source": {
          "id": "1",
          "uri": "dailypolitical.com",
          "title": "Daily Political"
        },
        "image": "https://www.marketbeat.com/logos/cryptocurrencies/1844.png",
        "wgt": 3
      },
      {
        "id": "13757698",
        "uri": "838937697",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2018-03-27",
        "time": "00:12:00",
        "dateTime": "2018-03-27T00:12:00Z",
        "sim": 0,
        "url": "https://www.dailypolitical.com/2018/03/26/hyper-pay-price-reaches-0-0282-on-major-exchanges-hpy.html",
        "title": "Hyper Pay Price Reaches $0.0282 on Major Exchanges (HPY)",
        "body": "Hyper Pay (CURRENCY:HPY) traded 3.6% lower against the US dollar during the 1-day period ending at 20:00 PM ET on March 26th. During the last week, Hyper Pay has traded up 8.1% against the US dollar. Hyper Pay has a market capitalization of $0.00 and approximately $57,279.00 worth of Hyper Pay was traded on exchanges in the last 24 hours. One Hyper Pay token can currently be bought for approximately $0.0282 or 0.00000345 BTC on major cryptocurrency exchanges.\n\nHere is how related cryptocurrencies have performed during the last 24 hours:\n\nGet Hyper Pay alerts: Ripple (XRP) traded 6.7% lower against the dollar and now trades at $0.60 or 0.00007333 BTC. Stellar (XLM) traded down 4.6% against the dollar and now trades at $0.23 or 0.00002798 BTC. NEO (NEO) traded 9.1% lower against the dollar and now trades at $59.49 or 0.00728182 BTC. IOTA (MIOTA) traded 6.5% lower against the dollar and now trades at $1.23 or 0.00015113 BTC. TRON (TRX) traded 2.3% lower against the dollar and now trades at $0.0444 or 0.00000543 BTC. Tether (USDT) traded up 0.1% against the dollar and now trades at $1.00 or 0.00012271 BTC. VeChain (VEN) traded 5.6% lower against the dollar and now trades at $3.19 or 0.00039035 BTC. Binance Coin (BNB) traded down 5.4% against the dollar and now trades at $12.12 or 0.00148351 BTC. Walton (WTC) traded 7.9% higher against the dollar and now trades at $22.77 or 0.00246724 BTC. Populous (PPT) traded down 1.8% against the dollar and now trades at $15.31 or 0.00187361 BTC.\n\nHyper Pay Token Profile\n\nHyper Pay launched on January 3rd, 2018. Hyper Pay's total supply is 2,650,000,000 tokens. Hyper Pay's official Twitter account is @hyperpay_tech and its Facebook page is accessible here. Hyper Pay's official message board is weibo.com/u/6358820994?refer_flag=1005050010_&is_hot=1. Hyper Pay's official website is hyperpay.tech.\n\nBuying and Selling Hyper Pay\n\nHyper Pay can be bought or sold on these cryptocurrency exchanges: EXX. It is not possible to purchase Hyper Pay directly using U.S. dollars. Investors seeking to acquire Hyper Pay must first purchase Bitcoin or Ethereum using an exchange that deals in U.S. dollars such as Gemini, GDAX or Changelly. Investors can then use their newly-acquired Bitcoin or Ethereum to purchase Hyper Pay using one of the aforementioned exchanges.\n\nReceive News & Updates for Hyper Pay Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for Hyper Pay and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.",
        "source": {
          "id": "1",
          "uri": "dailypolitical.com",
          "title": "Daily Political"
        },
        "image": "https://www.marketbeat.com/logos/cryptocurrencies/2329.png",
        "wgt": 4
      },
      {
        "id": "13755961",
        "uri": "838932171",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2018-03-27",
        "time": "00:12:00",
        "dateTime": "2018-03-27T00:12:00Z",
        "sim": 0.7921568751335144,
        "url": "https://www.digitaltrends.com/computing/nvidia-geforce-gtx-11-series-not-20-series/",
        "title": "Nvidia's next gaming cards could be the GTX 11 Series, not the GTX 20 Series",
        "body": "Nvidia's next family of graphics cards for gaming might not be the GeForce GTX 20 Series after all. An unnamed source claims that Nvidia will use the GTX 11 Series brand instead, staying somewhat true to the numerical order it's used for years. The branding makes perfect sense, but if the source is correct, Nvidia doesn't plan to label the new cards by tens, such as the current 1080 or 1070 models. Instead, Nvidia may go with the GTX 1181 or the GTX 1185.\n\nNvidia introduced the GeForce 100 series in 2009, the successor to the GeForce 9 series launched in 2008. The company's naming system progressed by the hundreds since the 100 Series hit the streets, ending with the 900 Series in 2016. Nvidia then jumped to the 10 Series in 2017 seemingly because it's simply easier to read (and type) than \"GeForce GTX 1000 Series\" even though the cards have four digits.\n\nYet in 2018, Nvidia's naming scheme could go either way and it works just fine in the overall big picture: GTX 11 Series or GTX 20 Series. But Nvidia's branding history shows that the company typically relies on product names that end with zeroes and fives, so the new, unannounced cards will likely end with a five as a logical differential from the current GTX 10 Series models.\n\nWhen the next family will appear is unknown, but all bets are placed on the GPU Technology Conference (GTC) starting on Tuesday, March 27, in San Jose, California. The company may reveal the GTX 11 Series (or GTX 20 Series) during the keynote that is reportedly based on a new architecture dubbed as \"Turing.\" Rumor points to a possible July release along with cards dedicated to cryptocurrency mining.\n\nAlso during the keynote, Nvidia could reveal new graphics cards slated for the enterprise and data centers based on a new architecture dubbed as \"Ampere.\" This design is to replace the current \"Volta\" architecture used in the Telsa V100 and Titan V add-in cards. The latter model could be used for gaming although Nvidia stresses that gaming is not its primary market.\n\nWhether the gaming cards will appear during the keynote or not depends on the source. GTC 2018 is the ideal launch platform although it's more fitting for Nvidia's enterprise-targeting products whereas the E3 2018 show in June is a better launchpad for its gaming cards. With a possible availability in July, the E3 2018 show seems more likely to be the GTX 11 Series big reveal.\n\nThen again, just look at the GTX 1080 and GTX 1070. Nvidia introduced those two cards at a special event in early May 2016 followed by a retail launch at the end of the month. Since then, the company has rolled out a large selection of GTX 10 Series cards, with the GTX 1080 Ti serving as the latest and final GTX 10 Series product.\n\nNvidia's keynote starts a 9 a.m. PT on March 27, so we will know more about the company's rumor-inducing plans during the broadcast.\n\nEditors' Recommendations Leak shows Inno3D cryptocurrency mining card based on the GTX 1080 Ti Digital Storm packs plenty of Nvidia GTX punch in its tiny Project Spark PC Nvidia's top-end GTX graphics cards could more than double in price Vizio P-Series (P65-E1) review Leaked Nvidia GTX 1050 Max-Q cards could target Intel AMD combo chips",
        "source": {
          "id": "4329",
          "uri": "digitaltrends.com",
          "title": "Digital Trends"
        },
        "image": "https://icdn5.digitaltrends.com/image/graphics-card-shortage-510x0.jpg",
        "wgt": 2
      },
      {
        "id": "13755938",
        "uri": "838932121",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-27",
        "time": "00:12:00",
        "dateTime": "2018-03-27T00:12:00Z",
        "sim": 0,
        "url": "http://www.straitstimes.com/business/banking/twitter-bans-crytocurrency-ads-on-fraud-fears-sending-bitcoin-sinking-below-us8000",
        "title": "Twitter bans crytocurrency ads on fraud fears, sending bitcoin sinking below US$8,000, Banking News & Top Stories - The Straits Times",
        "body": "SAN FRANCISCO (AFP)- Twitter on Monday (MARCH 26) announced a ban on ads for initial offerings of cryptocurrency or sales of virtual currency tokens, sending the value of bitcoin diving below USS$8,000.\n\nTwitter followed the lead of Google and Facebook, which earlier this year cracked down on digital currency ads to protect users from being duped.\n\n\"We are committed to ensuring the safety of the Twitter community,\" Twitter said in a statement.\"As such, we have added a new policy for Twitter Ads relating to cryptocurrency.\"\n\nUnder the new policy, the advertisement of ICOs, or initial currency offerings, and token sales will be prohibited at the global one-to-many messaging platform.\n\nSome startups have used ICOs to raise billions of dollars in a highly volatile, unregulated market.\n\nTwitter said: \"We know that this type of content is often associated with deception and fraud, both organic and paid, and are proactively implementing a number of signals to prevent these types of accounts from engaging with others in a deceptive manner.\"\n\nThe value of bitcoin dropped eight percent to US$7,929 after the Twitter ad ban was announced, according to market data from Bloomberg.\n\nThe new policy leaves open the door for ads for cryptocurrency exchanges or secure \"wallet\" services offered by public companies listed on some major exchanges.\n\nTwitter plans to modify its ad policy as the digital currency market evolves and its ability to distinguish dubious marketing messages improves.\n\nThe British government early this year called for global regulation of controversial virtual currency bitcoin, adding that the G-20 would address the topic this month.\n\nBitcoin is independent of governments and banks and uses blockchain technology, where encrypted digital coins are created by supercomputers.\n\nThe virtual currency is not regulated by any central bank but is instead overseen by a community of users who try to guard against counterfeiting.\n\nVirtual currency exchanges have seen tremendous volatility, and have sparked concerns they can be used to launder money for criminal networks.\n\nThe value of Litecoin also tanked on Monday, after the Singapore-based nonprofit Litecoin foundation put out word that payments processor LitePay ceased operations.\n\nLitePay had asked the foundation for more funding, but was \"unable to provide a satisfactory picture\" of what it did with the money it had already been given, according to a release.\n\n\"We are greatly disheartened that this saga has ended in this way and we apologize for not doing enough due diligence that could have uncovered some of these issues earlier,\" Litecoin foundation said in the release.\n\n\"We are currently working hard to tighten our due diligence practices and ensure that this does not happen again.\" Litecoin was down about 10 per cent to US$144.05 as of mid-day.",
        "source": {
          "id": "611",
          "uri": "straitstimes.com",
          "title": "The Straits Times"
        },
        "image": "https://static.straitstimes.com.sg/sites/default/files/styles/x_large/public/articles/2018/03/27/bp_twitter_270318_33.jpg?itok=RQ9OH1mH",
        "wgt": 5
      },
      {
        "id": "13754573",
        "uri": "838926539",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2018-03-27",
        "time": "00:00:00",
        "dateTime": "2018-03-27T00:00:00Z",
        "sim": 0,
        "url": "https://www.dailypolitical.com/2018/03/26/dao-casino-market-cap-hits-5-64-million-bet.html",
        "title": "DAO.Casino Market Cap Hits $5.64 Million (BET)",
        "body": "DAO.Casino (CURRENCY:BET) traded 0.9% lower against the dollar during the 1 day period ending at 19:00 PM Eastern on March 26th. One DAO.Casino token can now be bought for about $0.0337 or 0.00000412 BTC on exchanges. DAO.Casino has a market capitalization of $5.64 million and $3,332.00 worth of DAO.Casino was traded on exchanges in the last day. During the last week, DAO.Casino has traded down 4.3% against the dollar.\n\nHere's how related cryptocurrencies have performed during the last day:\n\nGet DAO.Casino alerts: Fusion (FSN) traded 11.8% lower against the dollar and now trades at $2.15 or 0.00026193 BTC. Joulecoin (XJO) traded 1.3% lower against the dollar and now trades at $0.0119 or 0.00000146 BTC. Tigercoin (TGC) traded 4.4% lower against the dollar and now trades at $0.0068 or 0.00000083 BTC. C-Bit (XCT) traded 4.4% lower against the dollar and now trades at $0.0013 or 0.00000016 BTC. Sling (SLING) traded flat against the dollar and now trades at $0.13 or 0.00001354 BTC. Save and Gain (SANDG) traded down 25.9% against the dollar and now trades at $0.0197 or 0.00000240 BTC. CaliphCoin (CALC) traded 2.2% higher against the dollar and now trades at $0.0007 or 0.00000008 BTC. Super Bitcoin (SBTC) traded down 8% against the dollar and now trades at $8.69 or 0.00106281 BTC. Xaucoin (XAU) traded 3.6% lower against the dollar and now trades at $0.0491 or 0.00000601 BTC. BetaCoin (BET) traded 12.3% lower against the dollar and now trades at $0.0025 or 0.00000030 BTC.\n\nAbout DAO.Casino\n\nDAO.Casino (CURRENCY:BET) is a proof-of-work (PoW) token that uses the SHA256 hashing algorithm. Its genesis date was October 24th, 2013. DAO.Casino's total supply is 167,270,821 tokens. DAO.Casino's official website is dao.casino. DAO.Casino's official Twitter account is @Betacoin.\n\nBuying and Selling DAO.Casino\n\nDAO.Casino can be bought or sold on the following cryptocurrency exchanges: HitBTC. It is not possible to buy DAO.Casino directly using U.S. dollars. Investors seeking to acquire DAO.Casino must first buy Ethereum or Bitcoin using an exchange that deals in U.S. dollars such as Changelly, GDAX or Coinbase. Investors can then use their newly-acquired Ethereum or Bitcoin to buy DAO.Casino using one of the aforementioned exchanges.\n\nReceive News & Updates for DAO.Casino Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for DAO.Casino and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.",
        "source": {
          "id": "1",
          "uri": "dailypolitical.com",
          "title": "Daily Political"
        },
        "image": "https://www.marketbeat.com/logos/cryptocurrencies/1771.png",
        "wgt": 3
      },
      {
        "id": "13754565",
        "uri": "838926538",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2018-03-26",
        "time": "23:59:00",
        "dateTime": "2018-03-26T23:59:00Z",
        "sim": 0,
        "url": "https://www.dailypolitical.com/2018/03/26/iot-chain-24-hour-volume-hits-8-21-million-itc.html",
        "title": "IoT Chain 24 Hour Volume Hits $8.21 Million (ITC)",
        "body": "IoT Chain (CURRENCY:ITC) traded 11% lower against the U.S. dollar during the 1-day period ending at 19:00 PM Eastern on March 26th. One IoT Chain token can now be purchased for about $0.97 or 0.00011770 BTC on cryptocurrency exchanges including Huobi, OKEx and Bibox. Over the last seven days, IoT Chain has traded up 16.5% against the U.S. dollar. IoT Chain has a total market cap of $46.94 million and $8.21 million worth of IoT Chain was traded on exchanges in the last 24 hours.\n\nHere is how similar cryptocurrencies have performed over the last 24 hours:\n\nGet IoT Chain alerts: Ripple (XRP) traded 6.1% lower against the dollar and now trades at $0.61 or 0.00007381 BTC. Stellar (XLM) traded 4.2% lower against the dollar and now trades at $0.23 or 0.00002804 BTC. NEO (NEO) traded 9.2% lower against the dollar and now trades at $59.85 or 0.00728756 BTC. IOTA (MIOTA) traded down 6.5% against the dollar and now trades at $1.24 or 0.00015128 BTC. TRON (TRX) traded 2.9% lower against the dollar and now trades at $0.0446 or 0.00000543 BTC. Tether (USDT) traded 0.1% higher against the dollar and now trades at $1.00 or 0.00012205 BTC. VeChain (VEN) traded 6.7% lower against the dollar and now trades at $3.18 or 0.00038748 BTC. Binance Coin (BNB) traded 3.9% lower against the dollar and now trades at $12.29 or 0.00149646 BTC. Walton (WTC) traded up 7.9% against the dollar and now trades at $22.77 or 0.00246724 BTC. Populous (PPT) traded down 2.7% against the dollar and now trades at $15.30 or 0.00186302 BTC.\n\nIoT Chain Profile\n\nIoT Chain's total supply is 100,000,000 tokens and its circulating supply is 48,602,869 tokens. The Reddit community for IoT Chain is /r/itcofficial and the currency's Github account can be viewed here. IoT Chain's official Twitter account is @IoT_Chain. The official website for IoT Chain is iotchain.io.\n\nIoT Chain Token Trading\n\nIoT Chain can be bought or sold on the following cryptocurrency exchanges: Bibox, Huobi and OKEx. It is not presently possible to purchase IoT Chain directly using US dollars. Investors seeking to trade IoT Chain must first purchase Ethereum or Bitcoin using an exchange that deals in US dollars such as GDAX, Changelly or Coinbase. Investors can then use their newly-acquired Ethereum or Bitcoin to purchase IoT Chain using one of the exchanges listed above.\n\nReceive News & Updates for IoT Chain Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for IoT Chain and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.",
        "source": {
          "id": "1",
          "uri": "dailypolitical.com",
          "title": "Daily Political"
        },
        "image": "https://www.marketbeat.com/logos/cryptocurrencies/iot-chain.png",
        "wgt": 4
      },
      {
        "id": "13754557",
        "uri": "838926536",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2018-03-26",
        "time": "23:59:00",
        "dateTime": "2018-03-26T23:59:00Z",
        "sim": 0,
        "url": "https://www.dailypolitical.com/2018/03/26/atmchain-achieves-market-cap-of-16-20-million-atm.html",
        "title": "ATMChain Achieves Market Cap of $16.20 Million (ATM)",
        "body": "ATMChain (CURRENCY:ATM) traded 26.1% lower against the US dollar during the 1 day period ending at 19:00 PM ET on March 26th. Over the last seven days, ATMChain has traded down 29.5% against the US dollar. One ATMChain token can now be purchased for $0.0035 or 0.00000043 BTC on cryptocurrency exchanges including Mercatox, EtherDelta, Livecoin and HitBTC. ATMChain has a market cap of $16.20 million and $5,157.00 worth of ATMChain was traded on exchanges in the last day.\n\nHere is how other cryptocurrencies have performed over the last day:\n\nGet ATMChain alerts: Dash (DASH) traded 5.9% lower against the dollar and now trades at $389.68 or 0.04745140 BTC. CPChain (CPC) traded 7.8% lower against the dollar and now trades at $0.11 or 0.00001312 BTC. I/O Coin (IOC) traded 4.5% lower against the dollar and now trades at $1.21 or 0.00014744 BTC. BitSend (BSD) traded 5.7% lower against the dollar and now trades at $0.59 or 0.00007138 BTC. B3Coin (KB3) traded 4.8% lower against the dollar and now trades at $0.0132 or 0.00000161 BTC. PinkCoin (PINK) traded down 6.6% against the dollar and now trades at $0.0174 or 0.00000213 BTC. Synergy (SNRG) traded 6.3% lower against the dollar and now trades at $1.32 or 0.00016170 BTC. Monoeci (XMCC) traded up 6.4% against the dollar and now trades at $1.18 or 0.00014418 BTC. BlueCoin (BLU) traded 3.1% lower against the dollar and now trades at $0.0045 or 0.00000055 BTC. InflationCoin (IFLT) traded up 28.8% against the dollar and now trades at $0.0001 or 0.00000001 BTC.\n\nAbout ATMChain\n\nATMChain is a PoW/PoS token that uses the X11 hashing algorithm. ATMChain's total supply is 10,000,000,000 tokens and its circulating supply is 4,660,285,460 tokens. ATMChain's official website is www.atmchain.io. ATMChain's official Twitter account is @ATMChainDev. The Reddit community for ATMChain is /r/atmchain.\n\nAccording to CryptoCompare, \"Autumcoin is a Proof of Work/Proof of Stake hybrid cryptocurrency. \"\n\nATMChain Token Trading\n\nATMChain can be traded on the following cryptocurrency exchanges: YoBit, Livecoin, HitBTC, EtherDelta and Mercatox. It is not presently possible to buy ATMChain directly using US dollars. Investors seeking to acquire ATMChain must first buy Bitcoin or Ethereum using an exchange that deals in US dollars such as Coinbase, Gemini or Changelly. Investors can then use their newly-acquired Bitcoin or Ethereum to buy ATMChain using one of the aforementioned exchanges.\n\nReceive News & Updates for ATMChain Daily - Enter your email address below to receive a concise daily summary of the latest news and updates for ATMChain and related cryptocurrencies with MarketBeat.com's FREE CryptoBeat newsletter.",
        "source": {
          "id": "1",
          "uri": "dailypolitical.com",
          "title": "Daily Political"
        },
        "image": "https://www.marketbeat.com/logos/cryptocurrencies/attention-token-of-media.png",
        "wgt": 5
      },
      {
        "id": "13754409",
        "uri": "838926130",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:58:00",
        "dateTime": "2018-03-26T23:58:00Z",
        "sim": 0,
        "url": "https://www.peninsulanewsreview.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Peninsula News Review",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "5858",
          "uri": "peninsulanewsreview.com",
          "title": "Peninsula News Review"
        },
        "image": "https://www.peninsulanewsreview.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13754356",
        "uri": "838925871",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:57:00",
        "dateTime": "2018-03-26T23:57:00Z",
        "sim": 0,
        "url": "https://www.burnslakelakesdistrictnews.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Burns Lake Lakes District News",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "18706",
          "uri": "burnslakelakesdistrictnews.com",
          "title": "Burns Lake District News"
        },
        "image": "https://www.burnslakelakesdistrictnews.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13754222",
        "uri": "838925509",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2018-03-26",
        "time": "23:55:00",
        "dateTime": "2018-03-26T23:55:00Z",
        "sim": 0,
        "url": "https://cointelegraph.com/news/bitcoin-ethereum-bitcoin-cash-ripple-stellar-litecoin-cardano-neo-eos-price-analysis-march-26",
        "title": "Bitcoin, Ethereum, Bitcoin Cash, Ripple, Stellar, Litecoin, Cardano, NEO, EOS: P...",
        "body": "The views and opinions expressed here are solely those of the author and do not necessarily reflect the views of Cointelegraph.com. Every investment and trading move involves risk, you should conduct your own research when making a decision.\n\nThe market data is provided by the HitBTC exchange.\n\nDuring a bear market, fear grips the investors, resulting in a long liquidation. While some believe that the bubble in Bitcoin has burst, others believe that the current fall is only a correction, which will lead to higher prices later in the year.\n\nFounder and chairman of investment firm LDJ Capital, David Drake believes that Bitcoin will rally to $30,000 by the year-end. That is a whopping 262 percent return from the current levels.\n\nJack Dorsey, the CEO of Twitter and Square, believes that Bitcoin can replace the fiat currencies within a decade.\n\nA few positive voices in a sea of gloom is a welcome change. Let's see if the short-term picture is improving or not.\n\nBTC/USD\n\nThough Bitcoin broke out of the descending channel on March 20, it could not cross above the 20-day EMA. Currently, prices are again threatening to dip back into the channel, which is a bearish development. Our long positions initiated at $8,800 are trading under a loss. As the setup looks negative, we suggest booking a loss on 50 percent of the open positions and holding the rest with the stops at $7,600.\n\nThe next support on the downside is the March 18 lows of $7,715, below which, a retest of the February 06 lows of $6,075.04 is possible.\n\nOur bearish view on the BTC/USD pair will be invalidated if prices breakout and sustain above the 50-day SMA.\n\nETH/USD\n\nEthereum is in a strong downtrend. It continues to trade inside the channel and below both the moving averages, which are falling sharply. The recovery attempt by the bulls failed at the $590 levels.\n\nThe final critical support on the downside is the March 18 lows of $452.32. Below this level, the ETH/USD pair can fall to $385.\n\nThe RSI is deeply oversold, which shows that the selling has been overdone. We anticipate another pullback attempt within the next few days. The first sign of strength will be when the bulls sustain above $600. Until then, the bears will continue to sell on rallies.\n\nBCH/USD\n\nBitcoin Cash has broken below the $1,000 levels after holding it for three days. The next support on the downside is the March 18 lows $884.7951.\n\nIf the BCH/USD pair breaks below this, it will retest the February 06 lows of $778.2021. Bears have the upper hand as they have not allowed the price to climb above the 20-day EMA since February 21.\n\nWe should turn positive only after the cryptocurrency breaks out of the 50-day SMA.\n\nXRP/USD\n\nOur anticipation of a range bound trading action on Ripple is proving to be wrong. Prices are falling sharply towards the lower end of the range at $0.56270. Our suggested long position at $0.71, on March 19 is deeply in the red. Our stop loss is at $0.52, just below the March 18 lows.\n\nIf the XRP/USD pair breaks below $0.5375, a fall to $0.22 is possible, because there is no support in between.\n\nThe cryptocurrency will become positive only above $0.72.\n\nXLM/USD\n\nStellar did not close above our buy trigger of $0.25, as recommended in the previous analysis. Therefore, we don't have any position in it.\n\nThe XLM/USD pair is gradually falling towards the $0.2 levels, which is a critical support. If this support breaks, the cryptocurrency can slide to the support line of the descending channel at $0.1 levels.\n\nWe'd better wait for prices to turn up before suggesting any long positions in it.\n\nLTC/USD\n\nOur long position in Litecoin recommended at $165 is under loss. Traders who have initiated long positions should keep the stop loss at $142.\n\nThe LTC/USD pair has again fallen below the downtrend line, which is a bearish sign. A critical support is the March 18 lows of $144.544. If this level breaks, the support line of the symmetrical triangle can provide support at $127, below which a retest of the February 02 lows of $107.102 will be on the cards.\n\nThe virtual currency will turn bullish only after it breaks out of the $200 levels.\n\nADA/BTC\n\nThough Cardano broke out of the downtrend line on March 21, it could not break out of the 20-day EMA and the horizontal resistance at 0.00002460. Our buy levels of 0.000025 have not triggered and stand canceled.\n\nThe ADA/BTC pair will spend a few days in the range of 0.00001690 and 0.00002460. A breakdown below the supports will prove to be bearish while a breakout will carry prices higher. Therefore, we need to wait for a breakout and close above the overhead resistance before initiating any trade.\n\nNEO/USD\n\nNEO has formed a bearish descending triangle pattern, which will complete on a breakdown and close below $65.\n\nAfter the initial bounce from the lows of $49.04 on March 18, we had expected the bulls to strongly defend the $65 levels during the pullback. However, after failing to rise above $70 for the past three days, prices have now broken down of the support levels.\n\nNext, if $49.04 level breaks, the NEO/USD pair can slide to $31.15 levels. Our bearish view will be invalidated if the bulls quickly reverse and sustain prices above $65.\n\nEOS/USD\n\nWe wanted to buy EOS once it broke out of the descending channel but that did not happen. After staying above the 20-day EMA for the past five days, prices have slipped this week.\n\nThe EOS/USD pair has some support at the $5.84 mark. Below that, it can slide to $5 levels.\n\nOn the upside, even if the bulls manage to push prices above the 20-day EMA, they will again face a stiff resistance at the 50-day SMA.\n\nThe market data is provided by the HitBTC exchange. The charts for the analysis are provided by TradingView.",
        "source": {
          "id": "19729",
          "uri": "cointelegraph.com",
          "title": "Cointelegraph"
        },
        "image": "https://cdn1.cointelegraph.com/images/1500_Ly9jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy8wYjA4M2ZhMDc4MDU5YzI1ZTZhNzVjZjhhMjA4MzI2Mi5qcGc=.jpg",
        "wgt": 4
      },
      {
        "id": "13753855",
        "uri": "838924495",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:52:00",
        "dateTime": "2018-03-26T23:52:00Z",
        "sim": 0,
        "url": "https://www.ashcroftcachecreekjournal.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Ashcroft Cache Creek Journal",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "21839",
          "uri": "ashcroftcachecreekjournal.com",
          "title": "Ashcroft Cache Creek Journal"
        },
        "image": "https://www.ashcroftcachecreekjournal.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13753660",
        "uri": "838923785",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:50:00",
        "dateTime": "2018-03-26T23:50:00Z",
        "sim": 0,
        "url": "https://www.goldstreamgazette.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Goldstream News Gazette",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "4043",
          "uri": "goldstreamgazette.com",
          "title": "Goldstream News Gazette"
        },
        "image": "https://www.goldstreamgazette.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13753605",
        "uri": "838923543",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:49:00",
        "dateTime": "2018-03-26T23:49:00Z",
        "sim": 0,
        "url": "https://www.saanichnews.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Saanich News",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "1812",
          "uri": "saanichnews.com",
          "title": "Saanich News"
        },
        "image": "https://www.saanichnews.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13753494",
        "uri": "838923154",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:48:00",
        "dateTime": "2018-03-26T23:48:00Z",
        "sim": 0,
        "url": "https://www.houston-today.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Houston Today",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "14229",
          "uri": "houston-today.com",
          "title": "Houston Today"
        },
        "image": "https://www.houston-today.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13753373",
        "uri": "838922856",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:47:00",
        "dateTime": "2018-03-26T23:47:00Z",
        "sim": 0,
        "url": "https://www.wltribune.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Williams Lake Tribune",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "5088",
          "uri": "wltribune.com",
          "title": "Williams Lake Tribune"
        },
        "image": "https://www.wltribune.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13753627",
        "uri": "838923621",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2018-03-26",
        "time": "23:47:00",
        "dateTime": "2018-03-26T23:47:00Z",
        "sim": 0,
        "url": "http://www.ign.com/articles/2018/03/26/7-reasons-to-jump-into-world-of-tanks-10",
        "title": "7 Reasons to Jump Into World of Tanks 1.0 - IGN",
        "body": "Share. An overhauled graphics engine and superior sound are just the beginning for this brave new World of Tanks. By Tristan Ogilvie\n\nWorld of Tanks 1.0 is now live across the game's North American, European and Asian servers, bringing with it a raft of new improvements and 29 completely reworked battlefields. Whether you're a die hard, lapsed player or newcomer, here are six reasons to get on board with the latest evolution of the massively multiplayer online tank shooter.\n\n1) It's the Product of Eight Years of Evolution\n\nEight years seems like a mighty long time between the initial release of a game and it's 1.0 overhaul, but according to Alexander de Giorgio, Regional Publishing Director for Wargaming APAC, the reality is that World of Tanks is a game that's been in constant motion and evolution since it first launched in 2010. \"We see World of Tanks as a living thing,\" says de Giorgio. \"It's been going now as a service to players for eight years, and that means a constant stream of updates, of new content, of new game modes, and sometimes things that didn't work, which we had to roll back. This is a constant experience of running a game like this, and so in that kind of mindset, eight years is like nothing. It just kind of comes along, it just happened.\"\n\nExit Theatre Mode\n\nThus when the development team began the process some four years ago of building the 1.0 version of the game, they set about reconfiguring the baseline architecture of the game to give it the best possible foundation for the future.\n\n\"\n\n\"1.0 was a way for us to say, here's a chapter, closing. And now the next chapter, is starting with CORE, with this new engine.\" - de Giorgio\n\n\"When the decision was made to build our own engine and to really rebuild the game basically from the ground up, that seemed like an obvious choice to be 1.0,\" explains de Giorgio. \"So, once that decision was made, that was the easy part. Then it was actually, okay, now build the engine and once you've built the engine, that was all well and good, but how do we integrate that engine into the game which is still running live on servers 24/7? How do you bring that in, without it impacting the existing players?\"\n\n\"So that whole process took another year, until we were at the stage where it really felt like, okay, this is a new game,\" says de Giorgio. \"1.0 was a way for us to say, here's a chapter, closing. And now the next chapter, is starting with CORE, with this new engine.\"\n\n2) Its CORE Engine Brings Realism to the Battlefield\n\nThe visual difference between World of Tanks 1.0 and its previous incarnation is night and day. The obvious enhancements to water, terrain, clouds and foliage make for battlefields far more immersive than ever before, and a new lighting system brings all that added detail into stark relief. A photorealistic skybox with clouds that drift on the wind, screen space reflections on water surfaces that reflect and refract objects, explosions, smoke and shadows, and over 100 different tree types are just a few of the differences the CORE engine affords, in addition to being much more flexible for the development team to tweak and adjust moving forward.\n\nExit Theatre Mode\n\n\"Flexibility was really important to us,\" explains de Giorgio. \"For example, say we want to make changes to the map, maybe map geometry. In our old engine, it was a very complex thing to do that. In our new engine, it allows us much more flexibility there, to deform terrain, deform buildings, these are things which fundamentally change the gameplay, and now we can do that, and test it and see if it works and then either scale it back or not, very quickly. So it allows us to iterate even faster, and my hope is that, going forward, we're going to be able to iterate in terms of new changes and new end dates even more effectively than we did in the past. And that's something which, in the industry as a rule, is becoming an expectation, and is becoming as a result an expectation for players.\"\n\nThe CORE engine has also been built in a way that new technologies can be easily integrated with it in the years ahead.\n\n\"We tried to build something which had a much more modular kind of approach to the architecture, where we could say, 'Oh, look, this new type of technology has come out, like hardware tessellation or like a bloom effect and log rays and all these kind of things, they're really cool, how do we integrate them into the game?\" says de Giorgio. \"Before, it was a headache, you know, developers trying to figure out how to do it without breaking something. Now it's like, oh, we can just plug it in and it works, and we can move on. Less time spent on developing backend, more time spent on developing front-end content, which is obviously where we want to be because that's what players actually really pay attention to.\"\n\n3) You Don't Necessarily Need a New PC to Run It\n\nWith cryptocurrency miners currently driving up the cost of graphics cards, some players might be wary of getting onboard with World of Tanks 1.0 under the expectation that a hardware upgrade is in order if they want to run the new CORE engine. But the good news is that even if you're an existing World of Tanks player who's been running the game for years on the same hardware specs, World of Tanks 1.0 is designed to be exceedingly scalable - imperative since it remains a free to play game seeking as wide an audience as possible.\n\n\"The ability to optimize across a huge variety [of systems], from small laptops to super-high-end gaming rigs is crucial for us,\" says de Giorgio. \"We want everyone to be able to play it, and we want someone who has spent the money on those expensive rigs to be able to take full advantage of it and have all the bells and whistles. But someone who wants to play the game on the machine that they have, they don't want to spend any more money on it, they can still do so, and still have fundamentally the same experience.\"\n\nExit Theatre Mode\n\nThe bottom line is that while those with beefier rigs might be getting the more realistic experience, in a gameplay sense the battleground is still a level playing field.\n\n\"One of the reasons [the development of 1.0] took so long is that we wanted to make sure that in terms of gameplay, it's the same gameplay,\" explains de Giorgio. \"If a map strategically worked in a certain way, it still works the same way.\"\n\n4) Glacier is the Perfect Showcase for the CORE Engine\n\nWhile the bulk of the maps in World of Tanks 1.0 are recreations of existing arenas, Glacier has been built from scratch using the new CORE engine. This brand new Sweden-set map isn't based on any specific locale or historical battle, since Sweden was a neutral state during World War II. But in this instance, historical accuracy can be damned because Glacier is one of the most jaw-dropping theaters of war yet to be featured in World of Tanks.\n\nAround a third of the map is covered in ice, with abandoned ships and dilapidated village remnants lodged in it, and to the northeast is a hulking aircraft carrier that provides an elevated spot to provide coverage for your team in the center of the map.\n\nFrom the reflections in the ice to the deformation of the snow under your tank treads, if you want to see the CORE engine at its present best, Glacier is the perfect showcase.",
        "source": {
          "id": "8333",
          "uri": "ign.com",
          "title": "IGN"
        },
        "image": "http://assets1.ignimgs.com/2018/03/26/worldoftanks-thumb-1522039435247_1280w.jpg",
        "wgt": 2
      },
      {
        "id": "13753316",
        "uri": "838922553",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:46:00",
        "dateTime": "2018-03-26T23:46:00Z",
        "sim": 0,
        "url": "https://www.crestonvalleyadvance.ca/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Creston Valley Advance",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "18728",
          "uri": "crestonvalleyadvance.ca",
          "title": "Creston Valley Advance "
        },
        "image": "https://www.crestonvalleyadvance.ca/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13753315",
        "uri": "838922518",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:46:00",
        "dateTime": "2018-03-26T23:46:00Z",
        "sim": 0,
        "url": "https://www.surreynowleader.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Surrey Now-Leader",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "21832",
          "uri": "surreynowleader.com",
          "title": "Surrey Now-Leader"
        },
        "image": "https://www.surreynowleader.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13753310",
        "uri": "838922483",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:46:00",
        "dateTime": "2018-03-26T23:46:00Z",
        "sim": 0,
        "url": "https://www.comoxvalleyrecord.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Comox Valley Record",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "3012",
          "uri": "comoxvalleyrecord.com",
          "title": "Comox Valley Record"
        },
        "image": "https://www.comoxvalleyrecord.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13753309",
        "uri": "838922482",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:46:00",
        "dateTime": "2018-03-26T23:46:00Z",
        "sim": 0,
        "url": "https://www.campbellrivermirror.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Campbell River Mirror",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "4596",
          "uri": "campbellrivermirror.com",
          "title": "Campbell River Mirror"
        },
        "image": "https://www.campbellrivermirror.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13753301",
        "uri": "838922466",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:46:00",
        "dateTime": "2018-03-26T23:46:00Z",
        "sim": 0,
        "url": "https://www.keremeosreview.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Keremeos Review",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "17770",
          "uri": "keremeosreview.com",
          "title": "Keremeos Review"
        },
        "image": "https://www.keremeosreview.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13753280",
        "uri": "838922411",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:46:00",
        "dateTime": "2018-03-26T23:46:00Z",
        "sim": 0,
        "url": "https://www.saobserver.net/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Salmon Arm Observer",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "1903",
          "uri": "saobserver.net",
          "title": "Salmon Arm Observer"
        },
        "image": "https://www.saobserver.net/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13753221",
        "uri": "838922276",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:46:00",
        "dateTime": "2018-03-26T23:46:00Z",
        "sim": 0,
        "url": "https://www.thenorthernview.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Prince Rupert Northern View",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "3715",
          "uri": "thenorthernview.com",
          "title": "The Northern View"
        },
        "image": "https://www.thenorthernview.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13753201",
        "uri": "838922233",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:46:00",
        "dateTime": "2018-03-26T23:46:00Z",
        "sim": 0,
        "url": "https://www.lakecountrycalendar.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Lake Country Calendar",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "5570",
          "uri": "lakecountrycalendar.com",
          "title": "Lake Country Calendar"
        },
        "image": "https://www.lakecountrycalendar.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13753190",
        "uri": "838922215",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:45:00",
        "dateTime": "2018-03-26T23:45:00Z",
        "sim": 0,
        "url": "https://www.langleytimes.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Langley Times",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "4184",
          "uri": "langleytimes.com",
          "title": "Langley Times"
        },
        "image": "https://www.langleytimes.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13752983",
        "uri": "838921659",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2018-03-26",
        "time": "23:44:00",
        "dateTime": "2018-03-26T23:44:00Z",
        "sim": 0,
        "url": "https://www.tinynibbles.com/blogarchives/2018/03/sex-news-stormy-daniels-goes-war-fosta-censorship-begins-male-pill-much.html",
        "title": "Sex News: Stormy Daniels goes to war, FOSTA censorship begins, the male pill, and much more - Violet Blue  | Open Source Sex",
        "body": "\"Stormy Daniels ramped up her legal battle against Trump on Monday, alleging in court that his personal attorney Michael Cohen defamed her by insinuating that she lied about an affair with Trump more than a decade ago. Daniels amended her existing lawsuit against Trump, adding Cohen as a defendant in the pending case. \"\n\n* Stormy Daniels accuses Trump attorney of defamation (Washington Post)\n\n* See also: Five takeaways from Stormy Daniels's big interview (The Hill) \"In the wake of this week's passage of the Allow States and Victims to Fight Online Sex Trafficking Act (FOSTA) bill in both houses of Congress on Wednesday, Craigslist has removed its \"Personals\" section entirely, and Reddit has removed some related subreddits.\"\n\n* Craigslist personals, some subreddits disappear after FOSTA passage (Ars Technica)\n\n* See also: Sex Workers Say Porn on Google Drive Is Suddenly Disappearing (Motherboard) Incredible resource. \"What is clear is that sites like Reddit will try to unload their [FOSTA-SESTA guesswork] to comply with this law onto users and volunteer moderators [VB note: and algorithms/censorship farms]. Right now, most users on these sites are in the dark with no clear path forward. A social media site can shut down your account whenever they want, for any reason, with no recourse or appeal. The First Amendment implications of this are still untested. One measure people have discussed is self-censoring your profile. \"\n\n* Post-SESTA/FOSTA Self-Censoring for Twitter, Reddit, and other Social Media (Tits and Sass) \"A proposal targeting online pornography and human trafficking billed as the \"Elizabeth Smart Law\" has grabbed headlines around the country for its unusual approach: require a filter which can be lifted with a $20 fee. But Smart, who was kidnapped from her Utah home as a teenager in 2002, has sent a cease-and-desist letter to demand her name be removed from it.\"\n\n* Elizabeth Smart wants her name removed from anti-porn bill (KUTV | Salt Lake City) \"Dorcel Lab is the latest innovation from Marc Dorcel, a pioneer in producing and distributing adult video on demand and virtual reality content. The first of its kind, the lab aims to help sex tech startups in France and around the world grow their businesses.\"\n\n* Sex Tech Incubator Dorcel Lab Takes on 5 Startups (Future of Sex)\n\nFind this post interesting? Support its creation on my Patreon page.\n\nTo all the feminists, women's orgs, Democrats, progressives, and NGOs that support end demand policies, know this: you literally prevent sex workers from turning away clients. YOU SUPPORT TRAFFICKING. #FOSTA #EndDemand #LetUsSurvive pic.twitter.com/VrGjsXbNp4\n\n-- JUNIPER (@juniperfitz) March 24, 2018\n\n\"There are no official figures on how many sex workers exist globally, with estimates roughly running between 13.8 and 30 million people. ... You won't read about sex workers' contributions to women's rights in the history books. Most of their efforts have been ridiculed at best, and ignored at worst.\"\n\n* What We Owe to the Hidden, Groundbreaking Activism of Sex Workers (Broadly/VICE) \"She carries two smartphones with her wherever she goes, including visits to her private clients. The older iPhone, which has a seafoam green case designed to resemble a cannabis prescription bottle, isn't tethered to any cell service, but can still pick up wifi. She uses it for music, storage and her \"public\" Snapchat. The other is a sturdy millenium pink. This is the one she uses to make nearly constant content on her \"VIP\" Snapchat.\"\n\n* The Sex Workers Making Underground Porn on Snapchat (Mel Magazine) \"Researchers in Germany have found hundreds of links to child sexual abuse imagery on Bitcoin's blockchain. This could make using the blockchain, a digital ledger of crypto-currency transactions, illegal.\"\n\n* 'Child porn links' on Bitcoin blockchain (BBC) \"Still in its infancy, Plexstorm aims expand its library of hosted games and become a worldwide social network and adult distribution platform. It plans to bring together game developers, adult content studios, talent, and fans.\"\n\n* Watch Models Play 3D Sex Games on New Adult Streaming Platform (Future of Sex) \"I posted about my Twitter shadowban (what it is, how it works, and the wider issue for adult content creators on social media platforms), way back in October last year. My account was shadowbanned before that and had been shadowbanned ever since. Note: This is not worth doing UNLESS you have been shadowbanned for ages\"\n\n* PSA: How I beat the Twitter shadowban (Domme Chronicles)\n\nMuch gratitude to our thoughtful sponsor, Nubile Films.\n\nUPDATE: The BBFC's position on user privacy and data security for sensitive personal sexual information can be summarised (in)effectively as follows:\n\n\"Don't ask us; ask the ICO\".\n\n(Mind the regulatory gap please ladies and gentlemen, nothing to see here). pic.twitter.com/Fu42i4lr49\n\n-- Myles Jackman (@MylesJackman) March 26, 2018\n\n\"A male contraceptive pill has been developed which is effective, safe and does not harm sex drive, scientists have announced.\"\n\n* Male contraceptive pill is safe to use and does not harm sex drive, first clinical trial finds (Telegraph) \"Just last year, in the promotional run-up to the delightful Super Mario Odyssey, an image was released revealing the exact shape and location of Mario's pert nipples. ... Now, in the run-up to the new title Mario Tennis Aces, they have released some screens of the characters in their new athleisure get-ups, and the breathable mesh tennis shorts reveal conclusively that Luigi, too, has a dick.\"\n\n* Luigi definitely has a dick, and it's 3.7 inches flaccid (AV Club) \"The MeToo movement has upended a status quo that tolerated sexual harassment at work. Well, at some workplaces.\"\n\n* Missing From #MeToo -- Sex Workers (1A) \"A male anglerfish's first and only sexual adventure results in his becoming permanently fused -- by his lips, no less -- to the side of a relatively gargantuan female that resembles David Cronenberg's nightmare about the shark from \"Jaws.\"\"\n\n* The worst sex in the world is anglerfish sex, and now there's finally video (Washington Post) \"Penthouse magazine told XBIZ today that it will be publishing an exclusive 12-page nude layout featuring adult superstar Stormy Daniels. ... Daniels' Penthouse pictorial and profile will be available on newsstands on May 8, with subscribers getting the magazine earlier.\"\n\n* Stormy Daniels Shoots Nude Pictorial for Penthouse Magazine (XBIZ)\n\nMain post image via This set of erotic Japanese vintage matchbox covers is charming af (Dangerous Minds).",
        "source": {
          "id": "17466",
          "uri": "tinynibbles.com",
          "title": "Violet Blue  | Open Source Sex"
        },
        "image": "https://www.tinynibbles.com/wp-content/uploads/2018/03/japanese_matchbox.jpg",
        "wgt": 2
      },
      {
        "id": "13752986",
        "uri": "838921680",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:44:00",
        "dateTime": "2018-03-26T23:44:00Z",
        "sim": 0,
        "url": "https://www.cranbrooktownsman.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Cranbrook Daily Townsman",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "18105",
          "uri": "cranbrooktownsman.com",
          "title": "Cranbrook Daily Townsman"
        },
        "image": "https://www.cranbrooktownsman.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13753051",
        "uri": "838921890",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:44:00",
        "dateTime": "2018-03-26T23:44:00Z",
        "sim": 0,
        "url": "https://www.missioncityrecord.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Mission City Record",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "5083",
          "uri": "missioncityrecord.com",
          "title": "Mission City Record"
        },
        "image": "https://www.missioncityrecord.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13753004",
        "uri": "838921758",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:44:00",
        "dateTime": "2018-03-26T23:44:00Z",
        "sim": 0,
        "url": "https://www.hopestandard.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Hope Standard",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "21838",
          "uri": "hopestandard.com",
          "title": "Hope Standard"
        },
        "image": "https://www.hopestandard.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13752967",
        "uri": "838921557",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:43:00",
        "dateTime": "2018-03-26T23:43:00Z",
        "sim": 0,
        "url": "https://www.peacearchnews.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Peace Arch News",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "4009",
          "uri": "peacearchnews.com",
          "title": "Peace Arch News"
        },
        "image": "http://www.peacearchnews.com/wp-content/uploads/2017/08/BPDefaultImage.jpg",
        "wgt": 2
      },
      {
        "id": "13752920",
        "uri": "838921329",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:43:00",
        "dateTime": "2018-03-26T23:43:00Z",
        "sim": 0,
        "url": "https://www.mapleridgenews.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Maple Ridge News",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "3478",
          "uri": "mapleridgenews.com",
          "title": "Maple Ridge News"
        },
        "image": "https://www.mapleridgenews.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13752915",
        "uri": "838921322",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:43:00",
        "dateTime": "2018-03-26T23:43:00Z",
        "sim": 0,
        "url": "https://www.barrierestarjournal.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Barriere Star Journal",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "21834",
          "uri": "barrierestarjournal.com",
          "title": "Barriere Star Journal"
        },
        "image": "https://www.barrierestarjournal.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13752910",
        "uri": "838921304",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2018-03-26",
        "time": "23:43:00",
        "dateTime": "2018-03-26T23:43:00Z",
        "sim": 0,
        "url": "https://www.prnewswire.com/news-releases/introducing-the-w12-platform-no-more-scam-ico-projects-300619817.html",
        "title": "Introducing the W12 Platform: No More Scam ICO Projects",
        "body": "SINGAPORE, March 26, 2018 /PRNewswire/ -- The W12 platform developers have released a smart contract prototype that gives ICO investors control over the spending of their invested funds. This new technological solution reduces the risk of loss of funds in ICOs by up to 95 percent, while increasing the total return on investment by more than 10 times.\n\nThe W12 ICO marketplace will give investors an opportunity to choose a new model of staged financing through a smart contract. This scheme is unprofitable primarily for fraudulent (\"scam\") projects, as it makes it impossible for scammers to obtain all of the funds from investors at once. A roadmap must be implemented to access the cryptocurrency funds. Thus, the W12 model will minimize the risk of losses in ICO projects by up to 95 percent.\n\nMoreover, it is not just a matter of clearing up scams and shutting down a company's website immediately after fundraising, but also about projects that will not be able to implement what was planned in 1-3 years of development and create value in the market. Experts report that up to 98 percent of projects on the ICO market today will never be implemented as their websites, whitepaper and roadmap claim. The value of tokens of such projects will definitely trend to zero in the future.\n\nThe system is transparent. ICO token buyers vote \"for\" or \"against\" prolonging the investment each time after a stage is implemented in accordance with the roadmap. If an ICO project does not fulfill its obligations, an investor has the right to recover the unused funds and reinvest them in other projects.\n\nThe W12 market-financing model solves the main problems of the ICO market - a plethora of scams, low investor confidence in ICO projects, and high risks when buying tokens of projects at an early stage. At the same time, the W12 marketplace provides an opportunity for projects aimed at creating a product and new technologies to raise funds without costs or specialized technical knowledge.\n\nAccording to statistics, the number of successful ICOs in 2017 decreased from 40 percent in the spring to 5 percent in the winter. The number of companies launching ICOs has reached 752. Competition is growing, while the number of \"raw\" and fraudulent projects that fail to fulfill their obligations is increasing. Confido, Munchee, PlexCorps and Benebit are just a few of these scammers. Given all this, investors have become very selective when choosing projects.\n\n\"Today, for many teams a successful ICO and fund-raising is equated with a successful EXIT from the project. According to this new model, teams will be focused on execution and developing technologies that will create the basis of a new economic era.\"\n\n* W12 founder, Oleg Sharpaty\n\nAn ICO project that opts for a W12 milestones-based financing model earns a high confidence rating and funds for implementation of its product because of the obligation to report for each stage. This is entirely justified, as at the launch of an ICO, token buyers transfer Ethereum, which already has value, to a project in exchange for project tokens that as yet have no value. At this stage, investors only have an expectation that the tokens will achieve a higher value in the future. In W12, these expectations will not only be backed up by words, but also by the project's obligations to token buyers.\n\nAdditional benefits of projects on the W12 platform include automated smart contracts and a technological solution for the release of tokens providing an opportunity to launch an ICO in just 1-1.5 hours.\n\n\"We have already invested in many ICO projects, so we see the problem from the inside. Unfortunately, the rating and popularity of a project do not guarantee the quality of its execution. All scam projects are well-known. Therefore, we set ourselves the goal to develop a tool that will bring ICO investments to a new level of mutually beneficial partnership, establish full transparency and a relationship of trust between a project and its token buyers. The investor, in turn, will not have to spend weeks on project research, while the project will save money for marketing and smart contracts development.\"\n\n- Andrei Granovsky, W12 founder\n\nThe W12 platform prototype is already available today (w12.io). The final release is scheduled for the summer of 2018.\n\nCompany information\n\nW12 is a DAICO marketplace. The company was founded in October, 2017.\n\nWhite list: registration open.\n\nPre-sale: May 04, 2018.\n\nCrowdsale: July 01, 2018\n\nWeb http://tokensale.w12.io\n\nWhite Paper http://tokensale.w12.io/W12-eng.pdf\n\nEmail enquires@w12.io\n\nRelated Images\n\nw12.jpg\n\nW12\n\nW12 DAICO marketplace\n\nWeb\n\nWhite Paper\n\nSOURCE W12",
        "source": {
          "id": "208",
          "uri": "prnewswire.com",
          "title": "PR Newswire"
        },
        "image": "https://content.prnewswire.com/designimages/prn_twitter_sharing_logo.png",
        "wgt": 3
      },
      {
        "id": "13752796",
        "uri": "838920965",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:42:00",
        "dateTime": "2018-03-26T23:42:00Z",
        "sim": 0,
        "url": "https://www.terracestandard.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Terrace Standard",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "8051",
          "uri": "terracestandard.com",
          "title": "Terrace Standard"
        },
        "image": "https://www.terracestandard.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13752812",
        "uri": "838921021",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:42:00",
        "dateTime": "2018-03-26T23:42:00Z",
        "sim": 0,
        "url": "https://www.pentictonwesternnews.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Penticton Western News",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "5561",
          "uri": "pentictonwesternnews.com",
          "title": "Penticton Western News"
        },
        "image": "https://www.pentictonwesternnews.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13752848",
        "uri": "838921172",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:42:00",
        "dateTime": "2018-03-26T23:42:00Z",
        "sim": 0,
        "url": "https://www.nanaimobulletin.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Nanaimo News Bulletin",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "1587",
          "uri": "nanaimobulletin.com",
          "title": "Nanaimo News Bulletin"
        },
        "image": "https://www.nanaimobulletin.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13752881",
        "uri": "838921242",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:42:00",
        "dateTime": "2018-03-26T23:42:00Z",
        "sim": 0,
        "url": "https://www.ominecaexpress.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Vanderhoof Omineca Express",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "13084",
          "uri": "ominecaexpress.com",
          "title": "Vanderhoof Omineca Express"
        },
        "image": "https://www.ominecaexpress.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13752870",
        "uri": "838921212",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:42:00",
        "dateTime": "2018-03-26T23:42:00Z",
        "sim": 0,
        "url": "https://www.northislandgazette.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - North Island Gazette",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "18113",
          "uri": "northislandgazette.com",
          "title": "North Island Gazette"
        },
        "image": "https://www.northislandgazette.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13752749",
        "uri": "838920914",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:41:00",
        "dateTime": "2018-03-26T23:41:00Z",
        "sim": 0,
        "url": "https://www.thefreepress.ca/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - The Free Press",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "2259",
          "uri": "thefreepress.ca",
          "title": "The Free Press"
        },
        "image": "https://www.thefreepress.ca/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13752745",
        "uri": "838920904",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:41:00",
        "dateTime": "2018-03-26T23:41:00Z",
        "sim": 0,
        "url": "https://www.sookenewsmirror.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Sooke News Mirror",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "4238",
          "uri": "sookenewsmirror.com",
          "title": "Sooke News Mirror"
        },
        "image": "https://www.sookenewsmirror.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13752726",
        "uri": "838920861",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:41:00",
        "dateTime": "2018-03-26T23:41:00Z",
        "sim": 0,
        "url": "https://www.ladysmithchronicle.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Ladysmith Chronicle",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "18169",
          "uri": "ladysmithchronicle.com",
          "title": "Ladysmith Chronicle"
        },
        "image": "https://www.ladysmithchronicle.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13752721",
        "uri": "838920842",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:41:00",
        "dateTime": "2018-03-26T23:41:00Z",
        "sim": 0,
        "url": "https://www.vicnews.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Victoria News",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "2869",
          "uri": "vicnews.com",
          "title": "Victoria News"
        },
        "image": "https://www.vicnews.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13752677",
        "uri": "838920677",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:41:00",
        "dateTime": "2018-03-26T23:41:00Z",
        "sim": 0,
        "url": "https://www.cloverdalereporter.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Cloverdale Reporter",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "4564",
          "uri": "cloverdalereporter.com",
          "title": "Cloverdale Reporter"
        },
        "image": "https://www.cloverdalereporter.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13752607",
        "uri": "838920471",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:40:00",
        "dateTime": "2018-03-26T23:40:00Z",
        "sim": 0,
        "url": "https://www.clearwatertimes.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Clearwater Times",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "18691",
          "uri": "clearwatertimes.com",
          "title": "Clearwater Times"
        },
        "image": "https://www.clearwatertimes.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13752581",
        "uri": "838920429",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:40:00",
        "dateTime": "2018-03-26T23:40:00Z",
        "sim": 0,
        "url": "https://www.kelownacapnews.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Kelowna Capital News",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "564",
          "uri": "kelownacapnews.com",
          "title": "Kelowna Capital News"
        },
        "image": "https://www.kelownacapnews.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13752580",
        "uri": "838920438",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:40:00",
        "dateTime": "2018-03-26T23:40:00Z",
        "sim": 0,
        "url": "https://www.thegoldenstar.net/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - The Golden Star",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "17806",
          "uri": "thegoldenstar.net",
          "title": "Golden Star"
        },
        "image": "https://www.thegoldenstar.net/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13752567",
        "uri": "838920413",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:40:00",
        "dateTime": "2018-03-26T23:40:00Z",
        "sim": 0,
        "url": "https://www.albernivalleynews.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Port Alberni Valley News",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "4220",
          "uri": "albernivalleynews.com",
          "title": "Alberni Valley News"
        },
        "image": "https://www.albernivalleynews.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      },
      {
        "id": "13752543",
        "uri": "838920369",
        "lang": "eng",
        "isDuplicate": true,
        "date": "2018-03-26",
        "time": "23:40:00",
        "dateTime": "2018-03-26T23:40:00Z",
        "sim": 0,
        "url": "https://www.vernonmorningstar.com/news/rcmp-criminals-use-dark-web-to-sell-canadians-guns/",
        "title": "RCMP: Criminals use dark web to sell Canadians guns - Vernon Morning Star",
        "body": "Mounties warn of ilicit gun sales made to Canadians through dark web\n\nCriminals are using the darker corners of the internet, hard-to-track digital currency and creative shipping techniques to sell illicit guns to Canadians, the RCMP warns.\n\nThe message comes as thousands of young people across North America demand an end to gun violence, and the Trudeau government moves to tighten laws on the licensing, sale and tracing of firearms.\n\nThe emergence of the darknet -- the hidden depths of the internet accessible only through tailored software -- is posing new challenges for authorities trying to tackle gun trafficking, said Rob O'Reilly, interim director of firearms regulatory services at the RCMP.\n\nWhile police have shut down rogue online markets like Silk Road in recent years, others quickly pop up in the deepest realms of cyberspace, O'Reilly recently told a national symposium on gangs and guns.\n\nRELATED: New Liberal bill would tighten controls on sale, licensing of firearms in Canada\n\nHe pointed to the Berlusconi online market, which at last count had 234 listings for weapons including AR-15 rifles, AK-47s, various handguns and countless rounds of ammunition.\n\nThe firearms are sold alongside opioids, heroin, cocaine, malware, stolen data, fraud tools, ransomware, pilfered credit cards and even depleted uranium, radioactive Polonium-210 and deadly poisons like ricin.\n\nO'Reilly displayed a photo of an AR-15 magazine and ammunition shipped from a vendor in Montana to a Sudbury, Ont., buyer who had no firearms licence.\n\nThe seller made a number of gun-related sales via the darknet before being arrested, each time wrapping the products in plastic and then in Mylar bags before finally disguising them in food packaging.\n\n\"Darknet vendors resort to very ingenious means to ship firearms and related components,\" O'Reilly said. \"In the darknet community, this is known as stealth shipping, and the intent is to disguise or hide the actual contents from law enforcement and border services.\"\n\nPistols have been sent in gaming consoles, computer hard drives, hairdryers and blocks of chocolate, he said. \"We've even seen rifles shipped behind flat-screen televisions.\"\n\nRELATED: Potential gun owners scrutinized under Canadian laws\n\nThe digital revolution has spawned tools that allow buyers to visit sites like Berlusconi anonymously and make purchases without leaving telltale signs.\n\nThe Onion Router network, known as Tor, is often used by government agencies, activists, journalists and whistleblowers who may want to shield their online activities, O'Reilly noted. However, it can also be employed by people with less noble intentions, such as illicit firearms buyers.\n\nSimilarly, cryptocurrencies like Bitcoin -- the most accepted form of currency on the darknet markets -- are used to obscure the transaction details from authorities.\n\n\"Such currencies present a real challenge for law enforcement because it doesn't physically reside somewhere, making it hard to trace without special, very expensive software and highly trained personnel to do the work,\" O'Reilly said.\n\nFirearms and related materials are more readily available than ever before due to access to global markets through the internet, he added. Different international laws mean some firearms components and accessories can be illegal in one country but completely legal in another.\n\n\"This challenge has existed for some time in regards to our neighbours to the south, however it is compounded in a borderless online market that is truly international,\" O'Reilly said. \"Once imported to Canada, these components can be easily finished and assembled through online tutorials, the results of which are often completely untraceable firearms, sometimes known as ghost guns.\"\n\nAt the same time, gun sales are occurring through more visible online vendors as well as internet forums.\n\nPolice training needs must be \"continually updated\" to reflect the rapidly evolving online environment, O'Reilly said. \"Conducting online investigations, whether on the darknet or on the surface web, requires a very specific skill set.\"",
        "source": {
          "id": "4114",
          "uri": "vernonmorningstar.com",
          "title": "Vernon Morning Star"
        },
        "image": "https://www.vernonmorningstar.com/wp-content/uploads/2018/03/11181639_web1_180326-BPD-guns.jpg",
        "wgt": 2
      }
    ],
    "totalResults": 15170,
    "page": 1,
    "count": 50,
    "pages": 304
  }
}